mhomran/BLDC-Openloop-STM32F407VG/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HA_Pin GPIO_PIN_5
#define HA_GPIO_Port GPIOA
#define HA_EXTI_IRQn EXTI9_5_IRQn
#define HB_Pin GPIO_PIN_6
#define HB_GPIO_Port GPIOA
#define HB_EXTI_IRQn EXTI9_5_IRQn
#define HC_Pin GPIO_PIN_7
#define HC_GPIO_Port GPIOA
#define HC_EXTI_IRQn EXTI9_5_IRQn
#define LSA_Pin GPIO_PIN_7
#define LSA_GPIO_Port GPIOE
#define HSA_Pin GPIO_PIN_8
#define HSA_GPIO_Port GPIOE
#define LSB_Pin GPIO_PIN_9
#define LSV_GPIO_Port GPIOE
#define HSB_Pin GPIO_PIN_10
#define HSV_GPIO_Port GPIOE
#define LSC_Pin GPIO_PIN_11
#define LSW_GPIO_Port GPIOE
#define HSC_Pin GPIO_PIN_12
#define HSW_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
